Store/app/controllers/orders_controller.rb

    def index
        orders = Order.all
---
SELECT "orders".* FROM "orders"

    def show
        order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        # Once the cart is loaded with the cart data, it will create the order and send the data to the back end
        #check Localhost/3000/orders
        order = Order.create
        orders_param[:products].each do |product_id|
            product = Product.find(product_id)
            orderProduct = OrderProduct.create(order_id: order.id, product_id: product.id)
---
INSERT INTO "orders" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-10-02 19:30:57.581068"], ["updated_at", "2019-10-02 19:30:57.581068"]]
SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "order_products" ("order_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 3], ["product_id", 2], ["created_at", "2019-10-02 19:30:57.605562"], ["updated_at", "2019-10-02 19:30:57.605562"]]

    def destroy
        order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]